filipleple/nuc140-linux-buildsystem/SampleCode/EduSample/Smpl_I2C_MMA7455/MMA7455_REG.h
// MMA7455 registers
#define MMA7455_XOUTL  0x00 
#define MMA7455_XOUTH  0x01 
#define MMA7455_YOUTL  0x02 
#define MMA7455_YOUTH  0x03 
#define MMA7455_ZOUTL  0x04 
#define MMA7455_ZOUTH  0x05 
#define MMA7455_XOUT8  0x06 
#define MMA7455_YOUT8  0x07 
#define MMA7455_ZOUT8  0x08 
#define MMA7455_STATUS 0x09
#define MMA7455_DETSRC 0x0A
#define MMA7455_TOUT   0x0B 
#define MMA7455_I2CAD  0X0D 
#define MMA7455_USRINF 0X0E 
#define MMA7455_WHOAMI 0X0F 
#define MMA7455_XOFFL  0x10 
#define MMA7455_XOFFH  0x11 
#define MMA7455_YOFFL  0x12 
#define MMA7455_YOFFH  0x13 
#define MMA7455_ZOFFL  0x14 
#define MMA7455_ZOFFH  0x15 
#define MMA7455_MCTL   0x16 
#define MMA7455_INTRST 0x17 
#define MMA7455_CTL1   0x18 
#define MMA7455_CTL2   0x19 
#define MMA7455_LDTH   0x1A 
#define MMA7455_PDTH   0x1B 
#define MMA7455_PW     0x1C 
#define MMA7455_LT     0x1D 
#define MMA7455_TW     0x1E 
